### Pandas 기초

In [1]:
import pandas as pd
import numpy as np

In [2]:
s = pd.Series([1,3,5,np.nan,6,8]) #NaN은 아무것도 없는(빈) 값
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [3]:
dates = pd.date_range('20130101', periods = 6) #datetime 자료형. 거의 쓰이지 않습니다
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [4]:
df = pd.DataFrame(np.random.randn(6,4), index = dates, columns = ['A', 'B', 'C', 'D']) #DataFrame은 딕셔너리나 array형 자료를 받습니다
df

                   A         B         C         D
2013-01-01  0.486156 -1.690607  1.775376  0.520096
2013-01-02  1.378498 -0.245152 -0.003215  0.798139
2013-01-03  0.372163 -0.538382 -0.912172  0.030659
2013-01-04 -0.086109 -0.257506  0.227056  1.304084
2013-01-05  1.575630 -0.245393  0.326327 -0.097732
2013-01-06 -0.569740  0.930194 -0.811206 -1.083041

In [5]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [6]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

In [7]:
df.values

array([[ 0.48615626, -1.69060741,  1.77537557,  0.52009592],
       [ 1.37849832, -0.24515248, -0.00321504,  0.79813927],
       [ 0.37216294, -0.53838152, -0.91217159,  0.03065891],
       [-0.08610925, -0.25750625,  0.22705627,  1.30408366],
       [ 1.57562977, -0.24539268,  0.32632688, -0.09773206],
       [-0.56973985,  0.93019435, -0.81120597, -1.08304057]])

In [8]:
df.describe() #각종 요약값 제공

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.526100 -0.341141  0.100361  0.245368
std    0.828137  0.836855  0.973621  0.828299
min   -0.569740 -1.690607 -0.912172 -1.083041
25%    0.028459 -0.468163 -0.609208 -0.065634
50%    0.429160 -0.251449  0.111921  0.275377
75%    1.155413 -0.245213  0.301509  0.728628
max    1.575630  0.930194  1.775376  1.304084

In [10]:
df.sort_values(by = 'B', ascending = False)

                   A         B         C         D
2013-01-06 -0.569740  0.930194 -0.811206 -1.083041
2013-01-02  1.378498 -0.245152 -0.003215  0.798139
2013-01-05  1.575630 -0.245393  0.326327 -0.097732
2013-01-04 -0.086109 -0.257506  0.227056  1.304084
2013-01-03  0.372163 -0.538382 -0.912172  0.030659
2013-01-01  0.486156 -1.690607  1.775376  0.520096

In [11]:
df['B']

2013-01-01   -1.690607
2013-01-02   -0.245152
2013-01-03   -0.538382
2013-01-04   -0.257506
2013-01-05   -0.245393
2013-01-06    0.930194
Freq: D, Name: B, dtype: float64

In [12]:
df[0:3] #슬라이싱은 행 단위로 실행

                   A         B         C         D
2013-01-01  0.486156 -1.690607  1.775376  0.520096
2013-01-02  1.378498 -0.245152 -0.003215  0.798139
2013-01-03  0.372163 -0.538382 -0.912172  0.030659

In [13]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02  1.378498 -0.245152 -0.003215  0.798139
2013-01-03  0.372163 -0.538382 -0.912172  0.030659
2013-01-04 -0.086109 -0.257506  0.227056  1.304084

In [14]:
df.loc[dates[0]]

A    0.486156
B   -1.690607
C    1.775376
D    0.520096
Name: 2013-01-01 00:00:00, dtype: float64

In [15]:
df.loc[:, ['A', 'B']]

                   A         B
2013-01-01  0.486156 -1.690607
2013-01-02  1.378498 -0.245152
2013-01-03  0.372163 -0.538382
2013-01-04 -0.086109 -0.257506
2013-01-05  1.575630 -0.245393
2013-01-06 -0.569740  0.930194

In [16]:
df.loc['20130102':'20130104', ['A', 'B']]

                   A         B
2013-01-02  1.378498 -0.245152
2013-01-03  0.372163 -0.538382
2013-01-04 -0.086109 -0.257506

In [17]:
df.loc[dates[0], 'A']

0.48615625586354311

In [18]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -0.086109 -0.257506
2013-01-05  1.575630 -0.245393

In [19]:
df.iloc[[1,2,4], [0,2]]

                   A         C
2013-01-02  1.378498 -0.003215
2013-01-03  0.372163 -0.912172
2013-01-05  1.575630  0.326327

In [19]:
df.iloc[1:3,:]

                   A         B         C         D
2013-01-02  0.159272  0.622331  1.413881  0.742409
2013-01-03  0.694497 -0.161016  0.335163  1.056785

In [20]:
df[df['A']>0]

                   A         B         C         D
2013-01-01  0.486156 -1.690607  1.775376  0.520096
2013-01-02  1.378498 -0.245152 -0.003215  0.798139
2013-01-03  0.372163 -0.538382 -0.912172  0.030659
2013-01-05  1.575630 -0.245393  0.326327 -0.097732

In [21]:
df[df>0] #value가 0이상인 값만 반환하고 이외에는 NaN 형태로 반환

                   A         B         C         D
2013-01-01       NaN  1.010584       NaN       NaN
2013-01-02  0.159272  0.622331  1.413881  0.742409
2013-01-03  0.694497       NaN  0.335163  1.056785
2013-01-04  0.046338       NaN  0.902871  0.033979
2013-01-05       NaN  0.436204  1.229982       NaN
2013-01-06  1.144971       NaN  0.377787       NaN

In [21]:
df2 = df.copy() #원본 df에는 변화를 적용하고 싶지 않다면 copy()를 사용해야 한다. 그냥 df2 = df로 하면 df2에 적용된 코드가 df에도 적용됨.
df2

                   A         B         C         D
2013-01-01  0.486156 -1.690607  1.775376  0.520096
2013-01-02  1.378498 -0.245152 -0.003215  0.798139
2013-01-03  0.372163 -0.538382 -0.912172  0.030659
2013-01-04 -0.086109 -0.257506  0.227056  1.304084
2013-01-05  1.575630 -0.245393  0.326327 -0.097732
2013-01-06 -0.569740  0.930194 -0.811206 -1.083041

In [22]:
df2['E'] = ['one', 'two', 'three', 'four', 'five', 'six']

In [24]:
df2['E'].isin(['two', 'four'])

2013-01-01    False
2013-01-02     True
2013-01-03    False
2013-01-04     True
2013-01-05    False
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [25]:
df2[df2['E'].isin(['two', 'four'])] #'E'행의 값이 'two'나 'four'인 열들을 반환

                   A         B         C         D     E
2013-01-02  1.378498 -0.245152 -0.003215  0.798139   two
2013-01-04 -0.086109 -0.257506  0.227056  1.304084  four

In [26]:
df

                   A         B         C         D
2013-01-01  0.486156 -1.690607  1.775376  0.520096
2013-01-02  1.378498 -0.245152 -0.003215  0.798139
2013-01-03  0.372163 -0.538382 -0.912172  0.030659
2013-01-04 -0.086109 -0.257506  0.227056  1.304084
2013-01-05  1.575630 -0.245393  0.326327 -0.097732
2013-01-06 -0.569740  0.930194 -0.811206 -1.083041

In [27]:
df.apply(np.cumsum) #열별 누적합을 반환

                   A         B         C         D
2013-01-01  0.486156 -1.690607  1.775376  0.520096
2013-01-02  1.864655 -1.935760  1.772161  1.318235
2013-01-03  2.236818 -2.474141  0.859989  1.348894
2013-01-04  2.150708 -2.731648  1.087045  2.652978
2013-01-05  3.726338 -2.977040  1.413372  2.555246
2013-01-06  3.156598 -2.046846  0.602166  1.472205

In [28]:
df.apply(lambda x : x.max()-x.min()) #E열이 문자형이라서 max값을 받을 수 없는 것

A    2.145370
B    2.620802
C    2.687547
D    2.387124
dtype: float64

In [29]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                   'B': ['B0', 'B1', 'B2', 'B3'],
                   'C': ['C0', 'C1', 'C2', 'C3'],
                   'D': ['D0', 'D1', 'D2', 'D3']},
                  index = [0,1,2,3])

df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                   'B': ['B4', 'B5', 'B6', 'B7'],
                   'C': ['C4', 'C5', 'C6', 'C7'],
                   'D': ['D4', 'D5', 'D6', 'D7']},
                  index = [4,5,6,7])

df3 = pd.DataFrame({'A': ['A8', 'A9', 'A10', 'A11'],
                   'B': ['B8', 'B9', 'B10', 'B11'],
                   'C': ['C8', 'C9', 'C10', 'C11'],
                   'D': ['D8', 'D9', 'D10', 'D11']},
                  index = [8,9,10,11])

In [30]:
df1

    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1
2  A2  B2  C2  D2
3  A3  B3  C3  D3

### DataFrame 병합하기

In [31]:
result = pd.concat([df1, df2, df3]) #열 방향으로 dataframe을 병합
result

      A    B    C    D
0    A0   B0   C0   D0
1    A1   B1   C1   D1
2    A2   B2   C2   D2
3    A3   B3   C3   D3
4    A4   B4   C4   D4
5    A5   B5   C5   D5
6    A6   B6   C6   D6
7    A7   B7   C7   D7
8    A8   B8   C8   D8
9    A9   B9   C9   D9
10  A10  B10  C10  D10
11  A11  B11  C11  D11

In [33]:
result = pd.concat([df1, df2, df3], keys = ['x', 'y','z']) #key는 인덱스와 비슷하다고 보면 됩니다
result

        A    B    C    D
x 0    A0   B0   C0   D0
  1    A1   B1   C1   D1
  2    A2   B2   C2   D2
  3    A3   B3   C3   D3
y 4    A4   B4   C4   D4
  5    A5   B5   C5   D5
  6    A6   B6   C6   D6
  7    A7   B7   C7   D7
z 8    A8   B8   C8   D8
  9    A9   B9   C9   D9
  10  A10  B10  C10  D10
  11  A11  B11  C11  D11

In [34]:
result.index

MultiIndex(levels=[['x', 'y', 'z'], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]],
           labels=[[0, 0, 0, 0, 1, 1, 1, 1, 2, 2, 2, 2], [0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11]])

In [39]:
result.index.get_level_values(0)

Index(['x', 'x', 'x', 'x', 'y', 'y', 'y', 'y', 'z', 'z', 'z', 'z'], dtype='object')

In [40]:
result.index.get_level_values(1)

Int64Index([0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11], dtype='int64')

In [36]:
df4 = pd.DataFrame({'B':['B2','B3','B6','B7'],
                  'D':['D2','D3','D6','D7'],
                  'F':['F2','F3','F6','F7']},
                   index = [2,3,6,7])
result = pd.concat([df1,df4], axis=1) #axis=0은 열(세로)방향 결합이고(입력 안해도 됨), axis=1은 행(가로)방향 결합이다

In [37]:
result

     A    B    C    D    B    D    F
0   A0   B0   C0   D0  NaN  NaN  NaN
1   A1   B1   C1   D1  NaN  NaN  NaN
2   A2   B2   C2   D2   B2   D2   F2
3   A3   B3   C3   D3   B3   D3   F3
6  NaN  NaN  NaN  NaN   B6   D6   F6
7  NaN  NaN  NaN  NaN   B7   D7   F7

In [38]:
result = pd.concat([df1,df4], axis=1, join = 'inner') #join = 'inner'를 통해 행 방향으로 NaN값이 존재하지 않게 결합한다
result

    A   B   C   D   B   D   F
2  A2  B2  C2  D2  B2  D2  F2
3  A3  B3  C3  D3  B3  D3  F3

In [39]:
result = pd.concat([df1,df4], axis=1, join_axes = [df1.index]) #df1의 인덱스에 맞추어 병합
result

    A   B   C   D    B    D    F
0  A0  B0  C0  D0  NaN  NaN  NaN
1  A1  B1  C1  D1  NaN  NaN  NaN
2  A2  B2  C2  D2   B2   D2   F2
3  A3  B3  C3  D3   B3   D3   F3

In [40]:
result = pd.concat([df1,df4], axis=0, ignore_index=True) #기존 인덱스를 무시하고 새롭게 인덱스를 부여
result

     A   B    C   D    F
0   A0  B0   C0  D0  NaN
1   A1  B1   C1  D1  NaN
2   A2  B2   C2  D2  NaN
3   A3  B3   C3  D3  NaN
4  NaN  B2  NaN  D2   F2
5  NaN  B3  NaN  D3   F3
6  NaN  B6  NaN  D6   F6
7  NaN  B7  NaN  D7   F7

In [41]:
left = pd.DataFrame({'key': ['K0','K4','K2','K3'],
                    'A': ['A0', 'A1', 'A2', 'A3'],
                    'B': ['B0', 'B1', 'B2', 'B3']})
right = pd.DataFrame({'key': ['K0','K1','K2','K3'],
                    'C': ['C0', 'C1', 'C2', 'C3'],
                    'D': ['D0', 'D1', 'D2', 'D3']})

In [42]:
left

    A   B key
0  A0  B0  K0
1  A1  B1  K4
2  A2  B2  K2
3  A3  B3  K3

In [43]:
right

    C   D key
0  C0  D0  K0
1  C1  D1  K1
2  C2  D2  K2
3  C3  D3  K3

In [44]:
pd.merge(left, right, on = 'key')

    A   B key   C   D
0  A0  B0  K0  C0  D0
1  A2  B2  K2  C2  D2
2  A3  B3  K3  C3  D3

In [45]:
pd.merge(left, right, how = 'left', on = 'key') #왼쪽 데이터프레임을 기준으로 병합

    A   B key    C    D
0  A0  B0  K0   C0   D0
1  A1  B1  K4  NaN  NaN
2  A2  B2  K2   C2   D2
3  A3  B3  K3   C3   D3

In [46]:
pd.merge(left, right, how = 'right', on = 'key')

     A    B key   C   D
0   A0   B0  K0  C0  D0
1   A2   B2  K2  C2  D2
2   A3   B3  K3  C3  D3
3  NaN  NaN  K1  C1  D1

In [54]:
pd.merge(left, right, how = 'outer', on = 'key') #how 값의 기본 옵션은 inner(교집합)이다

     A    B key    C    D
0   A0   B0  K0   C0   D0
1   A1   B1  K4  NaN  NaN
2   A2   B2  K2   C2   D2
3   A3   B3  K3   C3   D3
4  NaN  NaN  K1   C1   D1